Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Если Родитель = Справочники.Номенклатура.Товары Тогда
			Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
				Отказ = Истина;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.Услуги Тогда
			Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
				Отказ = Истина;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыСобственные Тогда
			Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Материал Тогда
				Отказ = Истина;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыКлиента Тогда
			Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.МатериалКлиента Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Сообщить("Выбранный тип номенклатуры не соответствует текущей группе!");
		Возврат;
	КонецЕсли;
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал Тогда
		Если СчетБухгалтерскогоУчета <> ПланыСчетов.Хозрасчетный.Материалы Тогда
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
		Если СчетБухгалтерскогоУчета <> ПланыСчетов.Хозрасчетный.Товары Тогда
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		Если СчетБухгалтерскогоУчета <> ПланыСчетов.Хозрасчетный.РасходыНаПродажу
			И СчетБухгалтерскогоУчета <> ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Сообщить("Счет бухгалтерского учета не соответствует типу номенклатуры!");
	КонецЕсли;

КонецПроцедуры
